//
//  TermsOfService.swift
//  GoodListener
//
//  Created by cheonsong on 2022/08/25.
//

import Foundation

struct TermsOfService {
    static let full = """
 제 1장 총칙

 제 1조 (목적)

본 약관은 귀하가 굿리스너(이하 “회사”)가 운영하는 굿리스너(이하 “서비스”) 서비스 이용과 관련하여 회사와 회원과의 권리, 의무, 책임 및 서비스 이용 등 기본적인 사항을 규정함을 목적으로 합니다.
이용자는 본 이용 약관을 자세히 읽은 후 이용 약관에 동의하지 않을 경우, 본 이용약관에 동의하지 말아야 하며 서비스에 등록하거나 이를 이용하지 않아야 합니다.

 제 2조 (용어의 정의)

가. '서비스' 접속 가능한 유∙무선 단말기의 종류와는 상관없이 이용 가능한 "회사"가 제공하는 모든 "서비스"를 의미합니다.
나. '이용자'란 회사 서비스에 접속하여, 이 약관에 따라 회사가 제공하는 서비스를 이용하는 회원과 비회원을 말합니다.
다. '회원'이란 회사와 서비스 이용 계약을 체결한 개인 또는 기업을 말합니다.
라. '닉네임'이란 회원식별과 회원의 서비스 이용을 위하여 회원이 선정하고 회사가 승인하는 문자열을 말합니다.
마. '비밀번호'란 회원이 사용하는 이메일과 일치하는 회원임을 확인하고 회원의 비밀 보호를 위해 회원 자신이 설정한 문자와 숫자의 조합을 말합니다.
바. '탈퇴'란 회사 또는 회원이 서비스 개통 후 이용계약을 해약하는 것을 말합니다.
사. '콘텐츠'란 회사가 제작 또는 회원이 업로드 하거나, 제휴사가 제공하는 동영상, 이미지, 텍스트 등 전부를 말합니다.
아. 리스너: 회사와 계약을 체결하여 회사가 제공하는 서비스를 통해 대화를 제공하는 비전문가를 말합니다.

 제 3조 (약관의 효력 및 변경)

① 본 약관은 서비스를 이용하고자 하는 모든 회원에게 그 효력이 발생합니다.
② 회원이 본 약관의 "동의하기" 버튼을 클릭하였을 경우 본 약관의 내용을 모두 읽고 이를 충분히 이해하였으며, 회사가 운영하는 본 서비스를 지속적으로 사용하는 것에 동의함을 의미합니다. 변경된 약관에 대한 정보를 알지 못하여 발생하는 회원의 피해에 대하여 회사는 책임이 없습니다.
③ 회사는 위치정보의 보호 및 이용 등에 관한 법률, 콘텐츠산업 진흥법, 전자상거래 등에서의 소비자보호에 관한 법률, 소비자기본법 약관의 규제에 관한 법률 등 관련법령을 위배하지 않는 범위에서 본 약관을 변경할 수 있습니다.
④ 회사가 약관을 변경할 경우에는 적용일자와 변경사유를 밝혀 본 서비스 화면에 게시하거나 기타의 방법으로  그 적용일자 3일 전부터 공지합니다. 다만, 변경 내용이 회원에게 불리한 경우에는 그 적용일자 30일 전부터 적용일 이후 상당한 기간 동안 각각 이를 서비스 홈페이지에 게시하거나 회원에게 전자적 형태(전자우편, SMS 등)로 약관 변경 사실을 발송하여 고지합니다.
이용자가 연락처를 기재하지 않았거나 변경하여 발송이 어려울 경우에는 본 서비스 화면에 변경 약관을 공지하는 것을 개별 발송한 것으로 간주합니다.
⑤ 회사가 본 조 제4항에 따라 변경약관을 공지하거나 통지하면서, 회원이 약관 변경 적용일까지 거부 의사를 표시하지 아니하면 약관 변경에 동의한 것으로 간주한다는 내용을 공지 또는 통지하였음에도 회원이 변경된 약관의 효력 발생일까지 약관 변경에 대한 거부 의사를 표시하지 않을 때에는 회원이 변경약관에 동의한 것으로 간주합니다. 회원은 변경된 약관에 동의하지 않으면 본 서비스의 이용을 중단하고 이용계약을 해지 할 수 있습니다.
⑥ 회사는 이용자가 요구하면 본 약관의 사본을 이용자에게 교부하며, 이용자가 서비스 내에서 본 약관을 인쇄할 수 있도록 조치합니다.

 제 4조 (관계법령의 적용)

본 약관은 신의성실의 원칙에 따라 공정하게 적용하며, 본 약관에 명시되지 아니한 사항에 대하여는 관계법령 또는 상관례에 따릅니다.

 제 5조 (회원가입)

① 회원이 되고자 하는 이용자는 회사가 정한 절차에 따라 이 약관과 개인정보의 수집, 제공 및 활용 동의서에 동의함으로써 회원 가입을 신청합니다.
② 모든 회원은 반드시 이용자 본인의 이메일 또는 회원가입에 필요한 정보를 제공하고 회원가입을 완료해야만 서비스를 이용할 수 있습니다.
③ 모든 회원은 가입 시 지정한 비밀번호에 의한 활동이나 행위 일체에 대한 책임을 부담합니다. 회사는 귀하에게 강력한 비밀번호(대∙소문자, 숫자 및 특수문자를 조합한 형태의 비밀번호)를 설정할 것을 권장합니다. 회사는 회원이 이를 준수하지 아니함으로 인하여 발생하는 손해에 대한 책임을 부담할 수 없습니다.
④ 회원가입계약의 성립시기는 이용자가 서비스에 접속하여 정보 입력 및 약관에 동의 후 가입을 완료하여 콘텐츠를 볼 수 있는 서비스 화면에 접속한 시점으로 합니다.
⑤ 이용자가 서비스를 이용하면서 기재하는 모든 정보는 실제 데이터인 것으로 간주되며, 허위의 정보를 입력한 이용자는 법적인 보호를 받을 수 없고, 서비스 이용에 제한을 받을 수 있습니다.
⑥ 정확한 정보로 등록하지 않은 이용자는 일체의 권리를 주장할 수 없으며, 타인의 정보를 도용하여 회원가입을 한 회원의 모든 계정은 삭제되며 관계 법령에 따라 처벌을 받을 수 있습니다.
⑦ 회사는 아래 사항에 해당하는 경우에 대하여 회원 가입 신청을 거부할 수 있습니다.
- 타인의 정보를 이용하거나 허위 내용으로 신청한 경우
- 사회의 질서를 저해할 목적으로 신청한 경우
- 영리를 추구할 목적으로 본 서비스를 이용하고자 하는 경우
- 부정한 용도로 본 서비스를 이용하고자 하는 경우
- 기타 규정에 위반되는 경우
⑧ 회원은 가입 시 회사에 제공한 정보에 변경이 있을 경우 즉시 전자우편, 기타 방법으로 회사에 그 변경사항을 알려야 합니다.

 제 6조 (계정 해지 및 회원탈퇴)

회원은 언제든지 회원 탈퇴 또는 계정 해지를 진행하거나 회사에 요청할 수 있으며 회사는 위 요청을 받은 즉시 “개인정보처리방침”에 따라 해당 회원의 정보 삭제를 위한 절차를 밟습니다.

 제 7조 (회사의 권리 및 의무)

① 회사는 관련 법령과 본 약관이 금지하거나 공서양속에 반하는 행위를 하지 않으며 본 약관이 정하는 바에 따라 지속적이고, 안정적인 서비스를 제공하기 위해서 노력합니다.
다만, 천재지변, 비상사태, 정기점검, 설비장애 또는 이용 폭주 등으로 인하여 서비스 이용에 지장이 있는 경우 등 부득이한 경우에는 그 서비스를 일시 중단하거나 중지할 수 있습니다.
② 회사는 회원이 안전하게 서비스를 이용할 수 있도록 개인정보 보호를 위해 보안시스템을 구축하며 개인정보처리방침을 공시하고 준수합니다.
③ 회사는 회원이 서비스 이용과 관련하여 의견과 불만을 제공할 경우 이것이 정당하다고 인정한다면 이를 처리하여야 합니다.
④ 회사는 회원이 서비스를 이용함에 있어 법률적인 증명이 가능한 고의 또는 중대한 과실을 입힐 경우 이로 인한 손해를 배상할 책임이 있습니다.
⑤ 회사는 서비스의 향상과 신규 서비스 개발, 심리 상담 관련 연구 등을 위하여 회원의 대화 요청 내용, 대화 내용 등 서비스 제공 과정에서 작성된 모든 자료와 정보를 익명화하여 수집하거나 통계, 연구 또는 심리상담 관련 개발에 활용할 수 있습니다.
⑥ 회사는 서비스 질의 향상화 사이트의 홍보를 위하여 서비스에서 작성된 이용 후기 등의 콘텐츠를 기타 포털사이트 등에 제휴와 협약 등을 통해 게시하거나 전송할 수 있습니다.

 제 8조 (리스너의 권리 및 의무)

① 제휴된 리스너는 회원에게 대화 서비스를 제공할 수 있습니다.
② 제휴된 리스너는 회사의 요청이 있는 경우, 심리 상담과 관련된 자격증 정보 등 최소한의 정보를 회사에 공개해야 합니다. 단, 정보를 전달함에 있어 거짓이 없어야 하며, 회사가 관련 증명서류를 요청할 경우 이에 응해야 합니다.
③ 제휴된 리스너는 회사가 제공하는 서비스의 지식재산권을 침해하는 행위를 해서는 안됩니다.
④ 제휴된 리스너는 회원의 개인정보를 무단으로 수집, 저장하여 개인의 영리적 목적으로 이용해서는 안됩니다.
⑤ 제휴된 리스너는 회원과의 대화 내용에 대하여 비밀준수의무를 지닙니다.
⑥ 제휴된 리스너는 광고, 스토킹, 장난 등 회사 서비스의 취지에 부합하지 않는 목적으로 대화를 요청하는 회원을 회사에 제보하거나 위법행위에 이르는 경우에는 경찰 등 수사기관에 신고할 수 있습니다.

 제 9조 (회원의 권한 및 의무)

① 이용자는 회원가입 또는 회원정보 변경 시 본인에 대하여 정확한 정보를 사실에 근거하여 작성하여야 합니다. 허위 또는 타인의 정보로 작성할 경우 일체의 권리를 주장할 수 없습니다.
② 회원은 본 약관에서 규정하는 사항과 공지사항, 기타 회사가 정한 규정 및 관계법령을 준수하여야 하며, 기타 회사의 업무에 방해되는 행위를 해서는 안됩니다. 이를 지키지 않을 경우, 서비스 이용에 제한을 받거나 적법조치를 포함한 제재를 받을 수 있습니다.
③ 회원은 이메일 주소 등 정보가 변경된 경우에 회사에 즉시 알려야 합니다. 회사가 관계법령 및 ‘개인정보처리방침’에 의거하여 그 책임을 지는 경우를 제외하고 회원의 계정, 비밀번호 등의 관리 소홀, 부정 사용으로 인하여 발생하는 모든 결과에 대한 책임은 회원에게 있습니다.
④ 회원은 상품 등을 구매하기 전에 반드시 회사가 제공하는 상품 등의 상세 내용과 조건을 정확하게 확인한 후 구매를 신청하여야 합니다. 구매하려는 상품 등의 상세 내용과 조건을 확인하지 않고 구매하여 발생하는 손해에 대하여 회원이 책임을 부담합니다.
⑤ 회원은 회사가 서비스를 안전하게 제공할 수 있도록 회사에 협조해야 하며, 회사가 회원의 이 약관 위반 행위를 발견하여 회원에게 해당 위반 행위에 대하여 소명을 요청할 경우 회원은 회사의 요청에 적극 응하여야 합니다.
⑨ 리스너는 회사와 제휴관계에 있음을 인식하고, 회원은 리스너의 귀책사유 있는 불법 내지 위법행위를 알게 된 경우 회사에 해당 사실을 통지하며, 회사는 관련 사실관계를 확인하고 리스너의 해촉 등 필요한 조치를 취합니다.
⑩ 본조 9항의 경우, 회원은 리스너에 대한 책임 청구 이외에 회사에 대하여는 리스너의 귀책사유 있는 불법 내지 위법행위에 대한 책임을 물을 수 없습니다.

 제 10조 (회원의 개인정보 보호)

회사는 관계법령이 정하는 바에 따라 회원의 개인정보를 보호하기 위해 노력합니다. 회원이 회사에 제공하는 정보 일체는 회사의 개인정보처리방침에 따릅니다. 단, 회사의 공식사이트와 어플리케이션 이외의 회사에 링크되어 있는 웹사이트들에서는 회사의 개인정보처리방침이 적용되지 않습니다. 회사는 이용자의 귀책사유로 인해 노출된 정보에 대해서 일체의 책임을 지지 않습니다. 또한 회사는 귀하에게 서비스 관련 공지사항 및 행정적 사안에 관한 전달사항을 제공할 필요가 있을 수 있습니다. 이러한 사항은 본 서비스 및 회원의 계정의 일부로 간주되며, 회원은 이를 수신거부 할 수 없습니다.

 제 11조 (회원의 금지행위)

① 회원은 다음 각 호에 해당하는 행위를 해서는 안되며, 해당행위를 하는 경우 서비스의 일부 또는 전부를 이용 정지하거나 서비스 이용 계약을 임의로 해지할 수 있으며, 이 경우 발생하는 손해에 대한 책임은 회원이 부담합니다. 회사는 필요한 경우 회원의 금지행위 사실을 관련 정부기관 또는 사법기관에 통지할 수 있으며 회원은 적법조치를 포함한 제재를 받을 수 있습니다.
- 서비스 이용 신청 또는 변경 시 허위 사실을 기재하거나, 타인의 정보를 도용하여 부정하게 사용하는 행위
- 회사가 게시한 정보를 변경하는 행위
- 회사가 정한 정보 이외의 정보를 송신하거나 게시하는 행위
- 회사와 기타 제 3자의 저작권 등 기타 권리를 침해하는 행위
- 회사 및 기타 제 3자의 명예를 손상시키거나 업무를 방해하는 행위
- 불특정 다수를 대상으로 하여 광고 또는 선전을 게시하거나 음란물 또는 불쾌감을 조성할 수 있는 글을 게시하는 행위
- 회사의 서비스를 이용하여 얻은 정보를 사전 승낙 없이 복제 또는 유통시키거나 상업적으로 이용하는 행위
- 욕이나 음담패설, 외설적 또는 규정에 적합하지 않은 행위
- 컴퓨터 소프트웨어, 하드웨어, 전기통신 장비 정상적인 가동을 방해 또는 파괴할 적으로 고안된 소프트웨어 바이러스, 기타 다른 컴퓨터 코드, 파일, 프로그램을 포함하고 있는 자료를 게시하거나 전송하는 행위
- 회사의 동의 없이 영리를 목적으로 서비스를 사용하는 행위
- 기타 관계 법령에 위배 또는 미풍양속에 반하는 행위
② 회원이 서비스 이용 과정에서 욕이나 음담패설, 외설적 행위를 할 경우 피해 주체가 된 리스너는 증빙 자료 확보 및 법적조치를 위해 회원의 금지행위에 대해 녹음/녹화하여 적절한 조치가 취해질 때까지 보유할 수 있으며, 이 과정에서 회원의 신체정보(성명, 얼굴, 음성 등), 정신, 재산, 사회적 정보와 개인정보가 수집될 수 있습니다.
③ 회원은 귀책사유로 인하여 회사나 다른 회원이 입은 손해를 배상할 책임이 있습니다.

 제 12조 (서비스 이용 제한)

① 다음의 사항에 해당하는 경우 회원의 콘텐츠에 대한 접근이 차단 또는 삭제되거나 서비스 이용이 제한될 수 있습니다.
- 다른 회원 또는 제3자를 비방하거나 중상 모략으로 명예를 손상시키는 경우
- 음란물, 욕설 등 공서양속에 위반되는 내용의 정보, 문장, 도형 등을 유포하는 경우
- 범죄행위와 관련이 있다고 판단되는 내용의 콘텐츠를 게시하는 경우
- 다른 회원 또는 제3자의 저작권 등 기타 권리를 침해하는 내용
- 종교적, 정치적 분쟁을 야기하는 내용으로서, 이러한 분쟁으로 인하여 회사의 업무가 방해되거나 방해되리라고 판단되는 경우
- 타인의 개인정보, 사생활을 침해하거나 명예를 손상시키는 경우
- 동일한 내용을 중복하여 다수 게시하는 등 게시의 목적에 어긋나는 경우
- 불필요하거나 승인되지 않은 광고, 판촉물을 게재하는 경우
- 그 외 불법적이거나 부당한 행위를 한 경우
② 회원이 작성한 ’콘텐츠’로 인한 법률상 이익 침해를 근거로, 다른 회원 또는 제3자가 회원 또는 회사를 대상으로 하여 민형사상의 법적 조치(예: 고소, 가처분신청, 손해배상청구소송)를 취하는 동시에 법적 조치와 관련된 게시물의 삭제를 요청해오는 경우, 회사는 동 법적 조치의 결과(예: 검찰의 기소, 법원의 가처분결정, 손해배상판결)가 있을 때까지 관련 게시물에 대한 접근을 임시적으로 제한할 수 있습니다.

 제 2장 서비스 이용

 제 13조 (서비스의 내용)

회사가 제공하는 서비스는 아래와 같습니다.
① 리스너와 전화 형태의 대화를 할 수 있도록 텍스트/음성 기능 제공, 대화 연결 및 대화 예약 기능, 대화 진행 및 결과에 대한 정보 제공 기능
② 회원이 예약한 대화와 관련된 알림 기능
③ 대화 후기 및 평가를 작성하고 공유하는 서비스
④ 자가진단을 위한 콘텐츠
⑤ 기타 회사가 본 서비스와 부합하며, 회원의 편의성을 향상시킨다고 판단하여 제공하는 모든 서비스

 제 14조 (서비스 이용계약)

① 서비스 이용계약은 이용자가 회사가 정한 이용약관에 대하여 ‘동의’를 하고 회원가입에 필요한 온라인 신청 양식을 작성하여 서비스 이용을 신청한 후 이에 대하여 회사가 승인함으로써 성립합니다.

 제 15조 (서비스 이용자격)

① 미성년자인 회원이 서비스를 이용하여 상품 등을 구매하고자 할 경우, 법정대리인으로부터 서비스 이용에 대한 동의를 받아야 합니다. 이 경우 법정대리인은 이용약관에서 규정하는 회원의 권리 및 의무를 모두 가집니다.
② 본 서비스를 이용하려면 앱(Application) 또는 웹(PC)가 반드시 필요하며, 정기적인 업데이트가 필요할 수 있습니다. 또한 이러한 요인에 의해 기능이 일부 영향을 받을 수 있으며, 이용자는 해당 내용에 대해 이해하고 있어야 합니다.

 제 16조 (서비스 이용 시 주의 사항)

① 회사가 제공하는 컨텐츠는 전문가의 검수를 받은 신뢰할 수 있는 정보이며, 의료 및 질병과 관련한 일체의 의문점이 있을 경우에는 반드시 의사와 상담하여야 합니다.
② 앱을 통해 제공되는 무료 심리상담은 의사의 진료를 대신할 수 없습니다. 고객의 부주의나 실수로 야기되는 문제점에 대해서 회사는 일체의 책임을 지지 아니합니다.

 제 17조 (서비스 이용요금)

① 회사가 제공하는 유료 서비스는 해당 서비스에 명시된 요금을 지불하여야 사용 가능합니다.
② 회사는 유료 서비스 이용요금을 회사와 계약한 전자지불업체에서 정한 방법에 의하거나 회사가 정한 청구서에 합산하여 청구할 수 있습니다.
③ 유료서비스 이용을 통하여 결제된 대금에 대한 취소 및 환불은 회사의 결제 이용약관 등 관계법에 따릅니다.
④ 회원의 개인정보도용 및 결제사기로 인한 환불요청 또는 결제자의 개인정보 요구는 법률이 정한 경우 외에는 거절될 수 있습니다.
⑤ 무선 서비스 이용 시 발생하는 데이터 통신료는 별도이며 가입한 각 이동통신사의 정책에 따릅니다.
⑥ 전화 대화시 인터넷 환경의 문제로 시스템 전화 연결이 불안정할 경우 가상번호를 이용하여 대화가 진행될 수 있습니다. 이 때 통화는 발신자 부담으로 진행되며, 발생 비용은 각 이동통신사의 정책에 따릅니다.
⑦ MMS 등으로 게시물을 등록할 경우 발생하는 요금은 이동통신사의 정책에 따릅니다.

 제 18 조 (서비스 내용 변경 통지 등)

① 회사가 서비스 내용을 변경하거나 종료하는 경우 회사는 회원의 등록된 전자우편 주소로 이메일을 통하여 서비스 내용의 변경 사항 또는 종료를 통지할 수 있습니다.
② ①항의 경우 불특정 다수인을 상대로 통지를 함에 있어서는 웹사이트 등 기타 회사의 공지사항을 통하여 회원들에게 통지할 수 있습니다.

 제 19조 (서비스 이용 제한 및 중지)

① 회사는 다음의 각 호에 해당하는 사유가 발생할 경우, 회원의 서비스 이용을 제한하거나 중지시킬 수 있습니다.
- 회원이 회사 서비스의 운영을 고의 또는 중과실로 방해하는 경우
- 다른 사람의 명의사용 등 이용자가 허위 정보로 서비스를 신청하는 경우
- 신청 시 필요한 사항을 허위로 기재하거나 중요한 사항에 기재누락 오기가 있는 경우
- 부정한 방법으로 서비스를 이용하거나 정보를 조작하여, 회사에 피해를 줄 수 있다고 판단하는 경우
- 회사에서 공지한 주의사항 또는 경고사항을 준수하지 않거나 동의하지 않는 경우
- 서비스용 설비 점검, 보수 등의 이유로 서비스 제공이 불가능한 경우
- 전기통신사업법에 규정된 기간통신사업자가 전기통신 서비스를 중지했을 경우
- 국가비상사태, 서비스 설비의 장애 또는 서비스 이용의 폭주 등으로 서비스 이용에 지장이 있는 때
- 기타 중대한 사유로 인하여 회사가 서비스 제공을 지속하는 것이 부적당하다고 인정하는 경우
② 회사는 전항의 규정에 의하여 서비스의 이용을 제한하거나 중지한 때에는 그 사유 및 제한기간 등을 회원에게 알려야 합니다.
③ 회사는 회원의 서비스 신청 이후에 제 1항의 사유가 있음을 알게 된 경우, 이용계약의 해지 또는 중단 등의 이용제한 조치를 취할 수 있습니다.

 제 20조 (회원정보와 대화정보)

① 회원은 언제든지 자신의 개인정보를 열람하고 수정할 수 있습니다.
② 회원이 전항의 변경사항을 수정하지 않아 불이익이 발생하였을 경우, 이에 대해 회사는 책임지지 않습니다.
③ 회원은 대화 서비스를 이용하기 위하여 대화 전 대화 접수지를 작성하여 제출하여야 합니다. 또한 대화 접수지를 통해 수집되는 내용은 서비스의 특성상 민감 정보가 포함 될 수 있다는 사실을 인정해야합니다.
④ 서비스 제공 및 이용을 위하여 수집된 회원의 개인정보와 대화 내용 등은 회사와 제휴된 리스너가 공유하며, 개인정보 수집과 관련된 세부내용은 개인정보처리방침을 따릅니다.
⑤ 전화 대화시 인터넷 환경의 문제로 시스템 전화 연결이 불안정할 경우 가상번호를 이용하여 대화가 진행될 수 있습니다. 이 때 회원의 전화번호가 담당 리스너에게 노출될 수 있으며 담당 리스너는 이를 누구와도 공유하지 않습니다.
⑥ 회원의 개인정보, 대화 접수지 정보, 대화 정보 등 그리고 회사가 운영하는 플랫폼에 회원이 게시한 글 등 서비스와 관련된 모든 정보는 회원의 동의에 따라 회사가 보관하며, 리스너와 공유할 수 있습니다. 또한 상기 대화 서비스와 관련된 모든 정보와 자료는 더 나은 서비스를 위하여 회사의 서비스 개발과 연구, 통계, 빅데이터 활용 등에 활용될 수 있다는 사실에 동의하고 인정합니다.

 제 21조 (이용계약의 해지)

① 회원이 이용계약의 해지를 원할 경우, 서비스 내의 회원 탈퇴 기능을 통하여 언제든지 회원탈퇴를 신청할 수 있습니다. 단, 해지의사를 통지하기 전에 현재 진행 중인 모든 상품의 거래를 완료하거나 규정에 맞게 취소 또는 환불을 진행하여야 하며, 거래를 취소했을 때 발생할 수 있는 불이익은 회원 본인이 부담하여야 합니다.
② 회원 탈퇴로 인해 발생한 불이익에 대한 책임은 회원 본인이 부담하여야 하며, 이용계약이 종료되면 회사는 회원에게 부가적으로 제공한 각종 혜택을 회수할 수 있습니다.
③ 회사는 불가피한 사정이 없는 한 회원의 탈퇴 요청을 처리해야 합니다.
④ 회사는 회원이 본 이용약관 또는 관계법령 등을 위반하는 경우, 이용계약을 해지할 수 있습니다.

 제 3장 기타

 제 22조 (저작권)

① 회사는 지식재산권을 존중하며, 본 서비스 이용자들이 타인의 지식재산권을 존중할 것이라 기대합니다.
② 회사가 제공하는 서비스, 회사가 개발한 검사지, 해설지 및 기타 모든 저작물에 대한 저작권, 기타 지식재산권 및 기타 모든 콘텐츠는 회사에 귀속합니다. 회원은 회사가 제공하는 서비스를 이용함으로써 얻은 정보를 회사의 사전 허락 없이 복제, 재가공, 전송, 출판, 배포, 방송, 기타 방법에 의하여 영리 목적으로 이용하거나 제3자에게 이용하게 하여서는 안됩니다.
③ 회원과 리스너가 대화 과정에서 작성하는 대화 내용과 게시하는 글 또는 회사가 운영하는 플랫폼에 게시하는 글 등 저작물의 저작권 또는 저작물의 이용권은 회사에 무상으로 영구적으로 귀속되며, 회사는 모든 자료와 정보를 익명화하여 수집하여 심리상담과 관련한 연구, 통계, 개발에 활용할 수 있습니다. 또한, 빅데이터 활용 또는 연구를 위해 제 3자에게 재이용권을 허락할 수 있습니다.

 제 23조 (서비스 게시물의 등록 및 관리)

① 회원은 약관에서 규정하는 범위 내에서 자율적으로 게시물을 작성할 수 있습니다.
② 회사는 회원의 게시물이 정보통신망법 및 저작권법 등 관련법에 위반되는 내용을 포함하였을 경우, 권리자는 관련법이 정한 절차에 따라 해당 게시물의 게시중단 및 삭제 등을 요청할 수 있으며, 회사는 관련법에 따라 조치를 취하여야 합니다. 또한, 권리자의 요청이 없는 경우라도 권리침해가 인정될 만한 사유가 있거나 기타 회사 정책 및 관련법에 위반되는 경우에는 관련법에 따라 해당 게시물에 대해 임시조치 등을 취할 수 있습니다.

 제 24조 (광고)

회사는 본 서비스에 당사 또는 제3자의 광고를 진행할 수 있습니다.

 제 25조 (손해배상)

① 회사가 관계법령에 따르는 규정을 위반한 행위로 회원에게 손해가 발생한 경우 회원은 회사에 대하여 손해배상 청구를 할 수 있습니다. 이 경우 회사는 고의, 과실이 없음을 입증하지 못하는 경우 책임을 면할 수 없습니다.
② 회원이 본 약관의 규정을 위반하여 회사에 손해가 발생한 경우 회사는 회원에 대하여 손해배상을 청구할 수 있습니다. 이 경우 회원은 고의, 과실이 없음을 입증하지 못하는 경우 책임을 면할 수 없습니다.

 제 26조 (면책조항)

① 회사는 아래의 각 호에 해당하는 경우 책임이 면제되며 이로 인한 손해를 배상할 책임도 없습니다.
- 천재지변, 전쟁 및 기타 이에 준하는 불가항력으로 인하여 서비스를 제공할 수 없을 경우
- 기간통신 사업자가 전기통신 서비스를 중지하거나 정상적으로 제공하지 아니하여 손해가 발생한 경우
- 서비스용 설비의 보수, 교체, 정기점검, 공사 등의 부득이한 사유로 손해가 발생할 경우
- 서비스 제공을 위하여 회사와 서비스 제휴계약을 체결한 제 3자의 고의적인 서비스 방해가 있는 경우
- 회원의 귀책사유로 인해 서비스 이용의 장애 또는 손해가 발생할 경우
- 이용자의 컴퓨터 오류에 의해 손해가 발생할 경우, 또는 회원이 신상정보 및 이메일 주소를 부정확하게 입력하거나 비밀번호를 부실하게 입력하여 손해가 발생할 경우
- 회원이 서비스를 이용하여 기대하는 수익을 얻지 못하거나 상실한 경우
- 회원이 서비스를 이용하면서 얻은 자료로 손해가 발생할 경우
- 회원이 서비스를 이용하며 타 회원으로 인해 정신적 피해를 입게 될 경우
- 회원이 서비스를 이용하면서 자료를 게시,전송, 저장, 조회함으로써 법적인 책임이 발생한 경우
- 회원 상호간 및 회원과 제 3자 상호 간에 서비스를 매개로 분쟁이 발생한 경우
- 회원이 검사지와 해설지 등 회사에서 제공하는 콘텐츠가 맞지 않다고 판단하는 경우
② 회사는 회원에게 무료로 제공하는 서비스의 이용과 관련해서는 어떠한 손해도 책임을 지지 않습니다.
③ 회사는 제휴된 리스너가 서비스와 관련하여 게재한 정보, 자료, 사실의 신뢰도와 정확성 등의 내용에 대하여 리스너가 기존에 회사에 제출한 서면 자료의 위조 또는 변조, 기타 사유에 의해 정보가 허위임을 인지하지 못했을 경우에 대해 책임을 지지 않습니다.
④ 회사는 회원에게 플랫폼을 제공하는 역할을 담당하며, 리스너의 대화 내용에 대한 진위 등을 판단할 수 없습니다.

 제 27조 (규정의 준용)

① 본 약관은 대한민국법령에 의하여 규정되고 이행됩니다.
② 본 약관에 규정되지 않은 사항에 대해서는 관련법령 및 상관습에 의합니다.

 제 28조 (분쟁의 조정 및 기타)

① 회사와 회원은 서비스와 관련하여 발생한 분쟁을 원만하게 해결하기 위하여 서로 성실하게 노력하여야 합니다.
② 회사가 제공하는 서비스는 합법적인 목적으로만 사용되어야 하며, 대한민국 법령에 반하는 형태의 사용은 금지됩니다. 회원의 금지된 형태의 사용으로 인하여 손해가 발생할 경우 회사는 이에 대해 책임을 지지 않습니다.
③ 회사와 회원 간에 전자상거래 관련 분쟁이 발생하는 경우 회원은 한국소비자원, 전자문서ㆍ전자거래분쟁조정위원회, 콘텐츠분쟁조정위원회에 피해 구제를 신청할 수 있습니다.
④ 서비스 이용으로 발생한 분쟁에 대해 소송이 제기되는 경우 회사의 본사 소재지를 관할하는 법원을 관할 법원으로 합니다.
"""
}
