//
//  TermsOfService.swift
//  GoodListener
//
//  Created by cheonsong on 2022/08/25.
//

import Foundation

struct TermsOfService {
    static let one = "제 1조 (목적)\n본 약관은 귀하가 굿리스너(이하 “회사”)가 운영하는 굿리스너(이하 “서비스”) 서비스 이용과 관련하여 회사와 회원과의 권리, 의무, 책임 및 서비스 이용 등 기본적인 사항을 규정함을 목적으로 합니다.\n이용자는 본 이용 약관을 자세히 읽은 후 이용 약관에 동의하지 않을 경우, 본 이용약관에 동의하지 말아야 하며 서비스에 등록하거나 이를 이용하지 않아야 합니다."
    
    static let two = "제 2조 (용어의 정의)\n가. '서비스' 접속 가능한 유∙무선 단말기의 종류와는 상관없이 이용 가능한 “회사”가 제공하는 모든 “서비스”를 의미합니다.\n나. '이용자'란 회사 서비스에 접속하여, 이 약관에 따라 회사가 제공하는 서비스를 이용하는 회원과 비회원을 말합니다.\n다. '회원'이란 회사와 서비스 이용 계약을 체결한 개인 또는 기업을 말합니다.\n라. '닉네임'이란 회원식별과 회원의 서비스 이용을 위하여 회원이 선정하고 회사가 승인하는 문자열을 말합니다.\n마. '비밀번호'란 회원이 사용하는 이메일과 일치하는 회원임을 확인하고 회원의 비밀 보호를 위해 회원 자신이 설정한 문자와 숫자의 조합을 말합니다.\n바. '탈퇴'란 회사 또는 회원이 서비스 개통 후 이용계약을 해약하는 것을 말합니다.\n사. '콘텐츠'란 회사가 제작 또는 회원이 업로드 하거나, 제휴사가 제공하는 동영상, 이미지, 텍스트 등 전부를 말합니다.\n아. 리스너: 회사와 계약을 체결하여 회사가 제공하는 서비스를 통해 대화를 제공하는 비전문가를 말합니다.\n자. 상담권: 상담사로부터 상담 서비스를 제공받기 위하여 이용자가 일정한 대가를 지급하고 구매하는 상담 서비스 상품을 말합니다."
    
    static let three = "제 3조 (예시)\n본 약관은 귀하가 굿리스너(이하 “회사”)가 운영하는 굿리스너(이하 “서비스”) 서비스 이용과 관련하여 회사와 회원과의 권리, 의무, 책임 및 서비스 이용 등 기본적인 사항을 규정함을 목적으로 합니다.\n이용자는 본 이용 약관을 자세히 읽은 후 이용 약관에 동의하지 않을 경우, 본 이용약관에 동의하지 말아야 하며 서비스에 등록하거나 이를 이용하지 않아야 합니다."
    
    static let four = "제 4조 (예시)\n본 약관은 귀하가 굿리스너(이하 “회사”)가 운영하는 굿리스너(이하 “서비스”) 서비스 이용과 관련하여 회사와 회원과의 권리, 의무, 책임 및 서비스 이용 등 기본적인 사항을 규정함을 목적으로 합니다.\n이용자는 본 이용 약관을 자세히 읽은 후 이용 약관에 동의하지 않을 경우, 본 이용약관에 동의하지 말아야 하며 서비스에 등록하거나 이를 이용하지 않아야 합니다."
    
    static let five = "제 5조 (예시)\n본 약관은 귀하가 굿리스너(이하 “회사”)가 운영하는 굿리스너(이하 “서비스”) 서비스 이용과 관련하여 회사와 회원과의 권리, 의무, 책임 및 서비스 이용 등 기본적인 사항을 규정함을 목적으로 합니다.\n이용자는 본 이용 약관을 자세히 읽은 후 이용 약관에 동의하지 않을 경우, 본 이용약관에 동의하지 말아야 하며 서비스에 등록하거나 이를 이용하지 않아야 합니다."
    
    static let six = "제 6조 (예시)\n본 약관은 귀하가 굿리스너(이하 “회사”)가 운영하는 굿리스너(이하 “서비스”) 서비스 이용과 관련하여 회사와 회원과의 권리, 의무, 책임 및 서비스 이용 등 기본적인 사항을 규정함을 목적으로 합니다.\n이용자는 본 이용 약관을 자세히 읽은 후 이용 약관에 동의하지 않을 경우, 본 이용약관에 동의하지 말아야 하며 서비스에 등록하거나 이를 이용하지 않아야 합니다."
    
    static let seven = "제 7조 (예시)\n본 약관은 귀하가 굿리스너(이하 “회사”)가 운영하는 굿리스너(이하 “서비스”) 서비스 이용과 관련하여 회사와 회원과의 권리, 의무, 책임 및 서비스 이용 등 기본적인 사항을 규정함을 목적으로 합니다.\n이용자는 본 이용 약관을 자세히 읽은 후 이용 약관에 동의하지 않을 경우, 본 이용약관에 동의하지 말아야 하며 서비스에 등록하거나 이를 이용하지 않아야 합니다."
    
    static let eight = "제 8조 (예시)\n 본 약관은 귀하가 굿리스너(이하 “회사”)가 운영하는 굿리스너(이하 “서비스”) 서비스 이용과 관련하여 회사와 회원과의 권리, 의무, 책임 및 서비스 이용 등 기본적인 사항을 규정함을 목적으로 합니다.\n이용자는 본 이용 약관을 자세히 읽은 후 이용 약관에 동의하지 않을 경우, 본 이용약관에 동의하지 말아야 하며 서비스에 등록하거나 이를 이용하지 않아야 합니다."
    
    static let full = one + "\n\n" + two + "\n\n" + three + "\n\n" + four + "\n\n" + five + "\n\n" + six + "\n\n" + seven + "\n\n" + eight
}
